a = [1,2,3]

# 특정 위치의 요소 하나를 통째로 교체
a[1] = ['a','b','c']
print(a)

print(a[0])
print(a[1])
print(a[1][0])

b = [1,2,3,4,5]
b[1:3] = [1000] # 두개 숫자를 빼고 리스트 하나만 넣은것
print(b)

# 슬라이싱 : 지정한 범위의 요소를 제거하고, 새로운 요소를 넣음
b[1:2] = ['a', 'b', 'c'] # 리스트로 갖고온 것을 리스트로 넣으시요. 
# b[1:2] = [['a', 'b', 'c']] # 리스트안에 리스트로 넣으려면 
print(b)

# 리스트로 오늘의 명언 10개 넣기/ 그중에 랜덤으로 하나 출력하기

a = ['삶이 있는 한 희망은 있다 -키케로',
    '산다는것 그것은 치열한 전투이다. -로망로랑', 
    '하루에 3시간을 걸으면 7년 후에 지구를 한바퀴 돌 수 있다. -사무엘존슨', 
    '언제나 현재에 집중할수 있다면 행복할것이다. -파울로 코엘료', 
    '진정으로 웃으려면 고통을 참아야하며 , 나아가 고통을 즐길 줄 알아야 해 -찰리 채플린',
    '직업에서 행복을 찾아라. 아니면 행복이 무엇인지 절대 모를 것이다 -엘버트 허버드',
    '신은 용기있는자를 결코 버리지 않는다 -켄러',
    '행복의 문이 하나 닫히면 다른 문이 열린다 그러나 우리는 종종 닫힌 문을 멍하니 바라보다가우리를 향해 열린 문을 보지 못하게 된다 – 헬렌켈러',
    '피할수 없으면 즐겨라 – 로버트 엘리엇', 
    '단순하게 살아라. 현대인은 쓸데없는 절차와 일 때문에 얼마나 복잡한 삶을 살아가는가?-이드리스 샤흐']

import random
b = random.randint(1,10)

print(f"오늘의 명언 : {a[b]}")