'''
편의점에서는 본사에서 구입한 물품의 가격에 일부 이익을 붙여서 손님에게 판매
오늘 구입 또는 판매한 물건의 총 매출을 계산하는 프로그램 만들기

구입가격 / 판매가격

a 캔 커피 : 500 900
b 삼각김밥 : 900 1400
c 바나나우유 : 800 1800
d 도시락 : 3500 4000
e 콜라 : 700 1500
f 새우깡 : 1000 2000

삼각김밥 10개 구입 900 * 10
바나나 우유 2개 판매 1800*2
도시락 5개 구입 3500 * 5
도시락 4개 판매 4000 * 4 
콜라 1개 판매 1500 * 1
새우깡 4개 판매 2000 * 4
캔커피 5개 판매 1800 * 5

'''

a = [500, 900]
b = [900, 1400]
c = [800, 1800]
d = [3500, 4000]
e = [700, 1500]
f = [1000, 2000]

sell = b[1]*2 + d[1]*4 + e[1]*1 + f[1]*4 + a[1]*5  
buy = b[0]*10 + d[0]*5

budget = 100000

total = budget - buy + sell
print("총 금액은 %d 입니다." %(total))