print(1,3,5)
print('더조은', '컴퓨터아카데미')
print("-" * 30)

# 구분자 +는 문자열일때는 연결하여 출력(띄어쓰기가 안된다)
print(1 + 3)
print('AI'+"강의실")

# print(1 + '이수현') int 와 string 타입이 다르기 때문에 출력에 오류가 생긴다.
# + 기호로 출력시에는 반드시 타입이 맞아야 한다.

print( str(1) + '이수현' )
print('1' + '이수현')
print('-'*30)

# 서식 출력 : %d(정수 decimal), %f 실수, %s 문자열
print('정수 : %d, 실수 : %f, 문자열 : %s' %(7, 3.14, '이름'))

# 자리지정 : %자리수d(정수), %자리수f(실수) - 점까지 포함한 전체 자릿수, %자리수s(문자열)
print('정수 : %3d, 실수 : %7.3f, %5s'%(7, 3.14, '나사람'))

print("실수형 소수점 둘째 자리까지만 출력 : %.2f, %.2f, %.2f" %(12.235311, 467274.48648, 8734.375))
print("-"*30)

# sep 속성
# : 분리 문자 설정 - 기본값은 공백문자 하나
print(5, 3.7, '더조은', True)
print(5, 5.7, '더조은', True, sep='/')
print(5, 5.7, '더조은', True, sep=' / ')
print(5, 5.7, '더조은', True, sep=', ')
print(5, 5.7, '더조은', True, sep='')
print('-' *30)

print('오늘은 목요일입니다. \n 수업 진행중 입니다.')
print('오늘은 목요일입니다. \t 수업 진행중 입니다.')
print('-' *30)

# end 속성 : 마지막 문자 설정 
print("Hello", end = '\n')
print('python', end = '')
print('더조은', end = '\t')
print('컴퓨터아카데미')
print("-"*30)

# format
print('{}, {}, {}'.format(100, "Hello", 3.141592))
print("{1}, {0}, {2}".format(100, "Hello", 3.141592))
print("이름 : {}, 나이 : {}, data = {}".format("송미나", 22, 233.34))
print("이름 : {1}, 나이 : {2}, data = {0}".format(233.34, "송미나", 22))
print()
print(format(3.14159))
print(format(3.14159, '.2f'))
print("원주율 =", format(3.14159))
print("원주율 = {}".format(3.14159))
print("원주율 =", format(3.14159,'.2f'))
print('금액 :', format(10000, '7d'))
print('금액 :', format(500000000, '3,d'))
print("-"*30)

# f- string 
# 문자열을 만드는 따옴표(' or ") 앞에 알파벳 f(or F)를 붙여줌
# 문자열 내부에서 변수를 넣고 싶은 자리에 {변수명}을 적는다
print('두 수의 합은', 3+5, '입니다.')
print('두 수의 합은 ' + str(3+5) + ' 입니다.')
print('두 수의 합은 %d 입니다.'%(3+5))
print(f'두 수의 합은 {3+5} 입니다.')
