# 5자리 확보 후, 왼쪽을 붙이기
a = '{0:<5d}'.format(200)
print(a + '8')

# 5자리 확보 후, 오른쪽으로 붙이기
b  = '{0:>5d}'.format(200)
print(b)

# 5자리 확보 후, 가운데 정렬
c = '{0:^5d}'.format(200)
print(c)

# 5자리 확보 후. 빈 공간을 0으로 채우고 오른쪽으로 정렬
d = '{0:>05d}'.format(200)
print(d)

# 5자리 확보 후. 빈 공간을 !으로 채우고 왼쪽 정렬
e = '{0:!<5d}'.format(200)
print(e)

# 5자리 확보 후. 빈 공간을 =으로 채우고 가운데 정렬
f = '{0:=^5d}'.format(200)
print(f)

# index 0 = 5자리 확보 후. 빈 공간을 *으로 채우고 가운데 정렬
# index 1 = 소수점 둘째자리까지 표시
g = '{0:*^5d},{1:.2f}'.format(200, 27354.144543)
print(g)